# version.sh

# Version history
# 2024-07-05 v1.0.0 - 初始化版本，包含基础功能和菜单选择，一键测试或者手动多选测试。
# 2024-07-05 v1.0.1 - 修复bug，回程路由ipv6测试占不支持。
# 2024-07-05 v1.0.2 - 修复若干bug。
# 2024-07-05 v1.0.3 - 修复若干bug，精简代码。
# 2024-07-18 v1.0.4 - 去除yabs的iperf3和gb6，单独增加gb5测试，优化更新脚本代码。
# 2024-07-18 v1.0.5 - 增加自动更新脚本。
# 2024-07-19 v1.0.6 - 优化更新脚本。
# 2024-07-21 v1.0.7 - 修复bug。
# 2024-07-21 v1.0.7 - 修复bug。
# 2024-07-21 v1.0.8 - 去除yabs的gb5
# 2024-07-29 v1.0.9 - 增加依赖安装
# 2024-07-31 v1.1.0 - 去除yabs的gb6测试，替换iperf3服务端vps
# 2024-08-08 v1.1.1 - 去除回程路由的ip等信息。
# 2024-08-13 v1.1.2 - 优化tab标签。
# 2024-08-19 v1.1.3 - 优化系统更新代码。
# 2024-08-28 v1.1.4 - 优化系统更新代码。
# 2024-09-07 v1.2.0 - 优化代码。
# 2024-09-07 v1.2.1 - 优化代码。
# 2024-09-07 v1.2.2 - 优化代码。
# 2024-09-08 v1.2.4 - 兼容新的接口。
# 2024-09-21 v1.2.5 - 修改bug。
# 2024-09-21 v1.2.6 - 删除融合怪。
# 2025-01-21 v1.2.7 - 改用Curl命令，优化国内连接